package com.kh.oop.basic;

public class 객체 {
    /*
    *
    * 客體(= 객체 손객 몸체 손= 손님 = 특정지을수 없는 대상)
    * 객관식 (= 주체적이지 않은 상태의 객, 볼 관, 특정 형식이나 방법의 방식)
    *
    *객체(Object) 클래스(class)를 기반으로 생성된 실체
    *
    *컴퓨터 내에서 표현하고자 하는 형태를 나타내는데 사용
    *속성(멤버 변수)과 행동(매서드 = 기능) 구성
    *
    *
    * */
    // 필드 = 속성 = 멤버변수 = 전역변수
    // 인스턴스 변수: 접근제한자    자료형 사이에 static이 없는 변수
    // 변수 HEAP 메모리에 할당
    // 클래스 변수: 접근제한자 static 자료형 사이에 static이 있는 변수
    // STATIC 메모리에 할당(이 된다는 것은 항상 어디서든 쓸 수 있게 준비한다는것! 글로벌 변수)

    //필드

    //매서드
        //기본생성자
        //필수생성자
        //Setter
        //Getter


}
